src/cf/src/Catalogs/ПроизводственноеОборудование/ПроизводственноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПроизводственноеОборудование</name>
  <attributes>
    <name>ВидСтанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаСменуЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладСтанка</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Выведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаетБезКалендаря</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РежимРаботы</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоСмены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеСмены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Круглосуточно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/ПроизводственноеОборудование/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Режим работы станка: у смены без флажка «Круглосуточно» начало не равно окончанию (00:00 - пустая дата:
	// пустая строка не должна молча стать круглосуточной сменой), смены одного дня не пересекаются.
	Для Каждого Стр Из РежимРаботы Цикл
		Если Не Стр.Круглосуточно И Стр.НачалоСмены = Стр.ОкончаниеСмены Тогда
			ТекстОшибки = НСтр("ru = 'Укажите время начала и окончания смены или отметьте «Круглосуточно»';
				|fr = 'Indiquez l''heure de début et de fin du poste ou cochez « 24 h/24 »';
				|en = 'Enter the shift start and end time or select ""Around the clock""';
				|es = 'Indique la hora de inicio y fin del turno o marque «24 horas»'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,
				"РежимРаботы[" + Формат(Стр.НомерСтроки - 1, "ЧГ=0") + "].ОкончаниеСмены", , Отказ);
		КонецЕсли;
	КонецЦикла;
	ПроверитьПересечениеСмен(Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Смены одного дня недели не пересекаются: фонд времени сливает пересечения, и двойной ввод смены прошёл бы
// незаметно. Смена через полночь сверяется в пределах суток своего дня.
//
// Параметры:
//  Отказ - Булево - выставляется при пересечении
//
Процедура ПроверитьПересечениеСмен(Отказ)
	Для Индекс1 = 0 По РежимРаботы.Количество() - 1 Цикл
		Стр1 = РежимРаботы[Индекс1];
		Для Индекс2 = Индекс1 + 1 По РежимРаботы.Количество() - 1 Цикл
			Стр2 = РежимРаботы[Индекс2];
			Если Не ЗначениеЗаполнено(Стр1.ДеньНедели) Или Стр1.ДеньНедели <> Стр2.ДеньНедели Тогда
				Продолжить;
			КонецЕсли;
			Интервал1 = ЗагрузкаСтанков.СменаВСекундах(Стр1.НачалоСмены, Стр1.ОкончаниеСмены, Стр1.Круглосуточно);
			Интервал2 = ЗагрузкаСтанков.СменаВСекундах(Стр2.НачалоСмены, Стр2.ОкончаниеСмены, Стр2.Круглосуточно);
			Если Интервал1.НачалоСекунд < Интервал2.ОкончаниеСекунд И Интервал2.НачалоСекунд < Интервал1.ОкончаниеСекунд Тогда
				ТекстОшибки = НСтр("ru = 'Смены строк %1 и %2 пересекаются';
					|fr = 'Les postes des lignes %1 et %2 se chevauchent';
					|en = 'The shifts in lines %1 and %2 overlap';
					|es = 'Los turnos de las líneas %1 y %2 se solapan'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон(ТекстОшибки, Стр1.НомерСтроки, Стр2.НомерСтроки), ЭтотОбъект,
					"РежимРаботы[" + Формат(Стр2.НомерСтроки - 1, "ЧГ=0") + "].НачалоСмены", , Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
